## production: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `github_actions_secret.slack_notify_dev_webhook[0]`                   |
|        | `github_actions_secret.system_status_bucket[0]`                       |
|        | `github_actions_secret.system_status_cloudfront_distribution[0]`      |
|        | `github_actions_secret.system_status_static_aws_access_key_id[0]`     |
|        | `github_actions_secret.system_status_static_aws_secret_access_key[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
16:33:40.923 STDOUT terraform:   + create
16:33:40.923 STDOUT terraform: Terraform will perform the following actions:
16:33:40.923 STDOUT terraform:   # github_actions_secret.slack_notify_dev_webhook[0] will be created
16:33:40.923 STDOUT terraform:   + resource "github_actions_secret" "slack_notify_dev_webhook" {
16:33:40.923 STDOUT terraform:       + created_at      = (known after apply)
16:33:40.923 STDOUT terraform:       + id              = (known after apply)
16:33:40.923 STDOUT terraform:       + plaintext_value = (sensitive value)
16:33:40.923 STDOUT terraform:       + repository      = "notification-system-status-frontend"
16:33:40.923 STDOUT terraform:       + secret_name     = "SLACK_NOTIFY_DEV_WEBHOOK"
16:33:40.923 STDOUT terraform:       + updated_at      = (known after apply)
16:33:40.923 STDOUT terraform:     }
16:33:40.923 STDOUT terraform:   # github_actions_secret.system_status_bucket[0] will be created
16:33:40.923 STDOUT terraform:   + resource "github_actions_secret" "system_status_bucket" {
16:33:40.923 STDOUT terraform:       + created_at      = (known after apply)
16:33:40.923 STDOUT terraform:       + id              = (known after apply)
16:33:40.923 STDOUT terraform:       + plaintext_value = (sensitive value)
16:33:40.923 STDOUT terraform:       + repository      = "notification-system-status-frontend"
16:33:40.924 STDOUT terraform:       + secret_name     = "PRODUCTION_SYSTEM_STATUS_BUCKET"
16:33:40.924 STDOUT terraform:       + updated_at      = (known after apply)
16:33:40.924 STDOUT terraform:     }
16:33:40.924 STDOUT terraform:   # github_actions_secret.system_status_cloudfront_distribution[0] will be created
16:33:40.924 STDOUT terraform:   + resource "github_actions_secret" "system_status_cloudfront_distribution" {
16:33:40.924 STDOUT terraform:       + created_at      = (known after apply)
16:33:40.924 STDOUT terraform:       + id              = (known after apply)
16:33:40.924 STDOUT terraform:       + plaintext_value = (sensitive value)
16:33:40.924 STDOUT terraform:       + repository      = "notification-system-status-frontend"
16:33:40.924 STDOUT terraform:       + secret_name     = "PRODUCTION_SYSTEM_STATUS_CLOUDFRONT_DISTRIBUTION"
16:33:40.924 STDOUT terraform:       + updated_at      = (known after apply)
16:33:40.924 STDOUT terraform:     }
16:33:40.924 STDOUT terraform:   # github_actions_secret.system_status_static_aws_access_key_id[0] will be created
16:33:40.924 STDOUT terraform:   + resource "github_actions_secret" "system_status_static_aws_access_key_id" {
16:33:40.924 STDOUT terraform:       + created_at      = (known after apply)
16:33:40.924 STDOUT terraform:       + id              = (known after apply)
16:33:40.924 STDOUT terraform:       + plaintext_value = (sensitive value)
16:33:40.924 STDOUT terraform:       + repository      = "notification-system-status-frontend"
16:33:40.924 STDOUT terraform:       + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
16:33:40.924 STDOUT terraform:       + updated_at      = (known after apply)
16:33:40.924 STDOUT terraform:     }
16:33:40.924 STDOUT terraform:   # github_actions_secret.system_status_static_aws_secret_access_key[0] will be created
16:33:40.924 STDOUT terraform:   + resource "github_actions_secret" "system_status_static_aws_secret_access_key" {
16:33:40.925 STDOUT terraform:       + created_at      = (known after apply)
16:33:40.925 STDOUT terraform:       + id              = (known after apply)
16:33:40.925 STDOUT terraform:       + plaintext_value = (sensitive value)
16:33:40.925 STDOUT terraform:       + repository      = "notification-system-status-frontend"
16:33:40.925 STDOUT terraform:       + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
16:33:40.925 STDOUT terraform:       + updated_at      = (known after apply)
16:33:40.925 STDOUT terraform:     }
16:33:40.925 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
16:33:40.925 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
16:33:40.925 STDOUT terraform: Saved the plan to: plan.tfplan
16:33:40.925 STDOUT terraform: To perform exactly these actions, run the following command to apply:
16:33:40.925 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
